read -sv run_verilog_mult_mid/multiplier_16b_732a640c36856851c49e54e27fc9021d.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_732a640c36856851c49e54e27fc9021d_wo_flatten_yosys.v
