read -sv run_verilog_mult_mid/multiplier_16b_98efbbcc0b35ae1dcfa19c979ffb6d17.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_98efbbcc0b35ae1dcfa19c979ffb6d17_wo_flatten_yosys.v
