read -sv run_verilog_mult_mid/multiplier_16b_255254a4a792e594eba37a0a85f2fa84.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_255254a4a792e594eba37a0a85f2fa84_wo_flatten_yosys.v
