read -sv run_verilog_mult_mid/multiplier_16b_2c24b1913ae3d49f87675a487387f920.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_2c24b1913ae3d49f87675a487387f920_wo_flatten_yosys.v
