read -sv run_verilog_mult_mid/multiplier_32b_fd7ee52b25f949c58187dbe2e0a4d337.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_fd7ee52b25f949c58187dbe2e0a4d337_wo_flatten_yosys.v
