read -sv run_verilog_mult_mid/multiplier_16b_d9b2b4f8d8c23f72d2680f0c0bdfe87e.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_d9b2b4f8d8c23f72d2680f0c0bdfe87e_wo_flatten_yosys.v
