read -sv run_verilog_mult_mid/multiplier_4b_922f20ae5cf3a430a190eaf608143bb6.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_4b_922f20ae5cf3a430a190eaf608143bb6_wo_flatten_yosys.v
