read -sv run_verilog_mult_mid/multiplier_16b_22556e9fe9310e5c24cafbc37cab3d21.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_22556e9fe9310e5c24cafbc37cab3d21_wo_flatten_yosys.v
