read -sv run_verilog_mult_mid/multiplier_16b_d959f0565b2da3bfd16d00281a47f63a.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_d959f0565b2da3bfd16d00281a47f63a_wo_flatten_yosys.v
