read -sv run_verilog_mult_mid/multiplier_16b_a7338a160a31138dda240cd325a28f60.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_a7338a160a31138dda240cd325a28f60_wo_flatten_yosys.v
