read -sv run_verilog_mult_mid/multiplier_16b_8d54004b3f4ff0f9b3726ae632eea33b.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_8d54004b3f4ff0f9b3726ae632eea33b_wo_flatten_yosys.v
