read -sv run_verilog_mult_mid/multiplier_4b_476fd3c7763317774d584158fb48f285.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_4b_476fd3c7763317774d584158fb48f285_wo_flatten_yosys.v
