read -sv run_verilog_mult_mid/multiplier_16b_5456c3c09af2d94323dbc5af1ed7c340.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_5456c3c09af2d94323dbc5af1ed7c340_wo_flatten_yosys.v
