read -sv run_verilog_mult_mid/multiplier_32b_6fd34206e69ff2aa6250177fadb083e1.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_6fd34206e69ff2aa6250177fadb083e1_wo_flatten_yosys.v
