read -sv run_verilog_mult_mid/multiplier_16b_f33713ba5c39ac6d55b0e4b8ce0179e9.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_f33713ba5c39ac6d55b0e4b8ce0179e9_wo_flatten_yosys.v
