read -sv run_verilog_mult_mid/multiplier_16b_67551dcb40ca96e817200b4ae883ade2.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_67551dcb40ca96e817200b4ae883ade2_wo_flatten_yosys.v
