read -sv run_verilog_mult_mid/multiplier_4b_a25a4c6ca0317098e1598cc867c64f19.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_4b_a25a4c6ca0317098e1598cc867c64f19_wo_flatten_yosys.v
