read -sv run_verilog_mult_mid/multiplier_16b_f3b30f858fb4db858ff5d1739d48fbd7.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_f3b30f858fb4db858ff5d1739d48fbd7_wo_flatten_yosys.v
