read -sv run_verilog_mult_mid/multiplier_32b_2ba9e963bb2e3f625ed6f1ded92132ce.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_2ba9e963bb2e3f625ed6f1ded92132ce_wo_flatten_yosys.v
