read -sv run_verilog_mult_mid/multiplier_16b_03902aca7c0dcfbe8ad35a18f900cf24.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_03902aca7c0dcfbe8ad35a18f900cf24_wo_flatten_yosys.v
