read -sv run_verilog_mult_mid/multiplier_32b_85735f105d5d6ac2dc628bb4e0403528.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_85735f105d5d6ac2dc628bb4e0403528_wo_flatten_yosys.v
