read -sv run_verilog_mult_mid/multiplier_4b_1afea3641c32e69bd6b66c31894650e7.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_4b_1afea3641c32e69bd6b66c31894650e7_wo_flatten_yosys.v
