read -sv run_verilog_mult_mid/multiplier_16b_5705cb55b558648a032389b99be5b9ce.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_5705cb55b558648a032389b99be5b9ce_wo_flatten_yosys.v
