read -sv run_verilog_mult_mid/multiplier_16b_6c2aa77823e42c3e0c55ec7b448a71fb.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_6c2aa77823e42c3e0c55ec7b448a71fb_wo_flatten_yosys.v
