read -sv run_verilog_mult_mid/multiplier_16b_2eddd772877d8c7ae8e6a2a4d31cc782.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_2eddd772877d8c7ae8e6a2a4d31cc782_wo_flatten_yosys.v
