read -sv run_verilog_mult_mid/multiplier_32b_fb7f3a2699d881818bed7eba016a56e9.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_fb7f3a2699d881818bed7eba016a56e9_wo_flatten_yosys.v
