read -sv run_verilog_mult_mid/multiplier_32b_362b81fbafe7b67c7049dcc3f42a5d8a.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_362b81fbafe7b67c7049dcc3f42a5d8a_wo_flatten_yosys.v
