read -sv run_verilog_mult_mid/multiplier_16b_2935555cf5b3094e022269ee3140944e.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_2935555cf5b3094e022269ee3140944e_wo_flatten_yosys.v
