read -sv run_verilog_mult_mid/multiplier_16b_c67f5ac33cd7115a59782ed3498d9cab.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_c67f5ac33cd7115a59782ed3498d9cab_wo_flatten_yosys.v
