read -sv run_verilog_mult_mid/multiplier_16b_caaf7eae122a5c982d9cc85ed84f0ce1.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_caaf7eae122a5c982d9cc85ed84f0ce1_wo_flatten_yosys.v
