read -sv run_verilog_mult_mid/multiplier_16b_08c5a08edc1a29c674a83c3074aafc2b.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_08c5a08edc1a29c674a83c3074aafc2b_wo_flatten_yosys.v
