read -sv run_verilog_mult_mid/multiplier_16b_635b2b4882ea2caf40f8d7c22a08ea43.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_635b2b4882ea2caf40f8d7c22a08ea43_wo_flatten_yosys.v
