read -sv run_verilog_mult_mid/multiplier_4b_d87915384ed14cbcf9b8e0d0644c4342.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_4b_d87915384ed14cbcf9b8e0d0644c4342_wo_flatten_yosys.v
