read -sv run_verilog_mult_mid/multiplier_32b_a919750735f5dbb7073edf0db9466145.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_a919750735f5dbb7073edf0db9466145_wo_flatten_yosys.v
