read -sv run_verilog_mult_mid/multiplier_16b_f0d46b7f291612e2e9e069e0c9eab37b.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_f0d46b7f291612e2e9e069e0c9eab37b_wo_flatten_yosys.v
