read -sv run_verilog_mult_mid/multiplier_32b_7a53b75f1dffe769e82ed9a365e3ccb4.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_7a53b75f1dffe769e82ed9a365e3ccb4_wo_flatten_yosys.v
