read -sv run_verilog_mult_mid/multiplier_16b_0f3f7bc7960922208dd0213f0535b10d.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_0f3f7bc7960922208dd0213f0535b10d_wo_flatten_yosys.v
