read -sv run_verilog_mult_mid/multiplier_16b_49b8578f25fe98b29148ed99530641b0.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_49b8578f25fe98b29148ed99530641b0_wo_flatten_yosys.v
