read -sv run_verilog_mult_mid/multiplier_16b_5f90d64718de0564d8b6ca2ac5d6776f.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_5f90d64718de0564d8b6ca2ac5d6776f_wo_flatten_yosys.v
