read -sv run_verilog_mult_mid/multiplier_16b_34c8d6330cad908ac13b8550abfd0194.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_34c8d6330cad908ac13b8550abfd0194_wo_flatten_yosys.v
