read -sv run_verilog_mult_mid/multiplier_4b_4359ccad55b28be59d19137252a21c82.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_4b_4359ccad55b28be59d19137252a21c82_wo_flatten_yosys.v
