read -sv run_verilog_mult_mid/multiplier_16b_eb3f56f463a27b9a9a77cb792bb2a5f9.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_eb3f56f463a27b9a9a77cb792bb2a5f9_wo_flatten_yosys.v
