read -sv run_verilog_mult_mid/multiplier_16b_c8c7ded59e91ed49a5118f77189baff4.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_c8c7ded59e91ed49a5118f77189baff4_wo_flatten_yosys.v
