read -sv run_verilog_mult_mid/multiplier_16b_f6a8acf8325e949dd14816fb9cf87323.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_f6a8acf8325e949dd14816fb9cf87323_wo_flatten_yosys.v
