read -sv run_verilog_mult_mid/multiplier_32b_2dda64d164fe2397ca72f82191aedd1c.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_2dda64d164fe2397ca72f82191aedd1c_wo_flatten_yosys.v
