read -sv run_verilog_mult_mid/multiplier_16b_da82819fed77756fb75a2fb2c8c46dcc.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_da82819fed77756fb75a2fb2c8c46dcc_wo_flatten_yosys.v
