read -sv run_verilog_mult_mid/multiplier_16b_200d664c8cd326285b1c4cdf01f1c388.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_200d664c8cd326285b1c4cdf01f1c388_wo_flatten_yosys.v
