read -sv run_verilog_mult_mid/multiplier_16b_692dcb8a794c201c5a2aac71341e3602.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_692dcb8a794c201c5a2aac71341e3602_wo_flatten_yosys.v
