read -sv run_verilog_mult_mid/multiplier_4b_eee6499652194f063be5b89d5d42460f.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_4b_eee6499652194f063be5b89d5d42460f_wo_flatten_yosys.v
