read -sv run_verilog_mult_mid/multiplier_16b_8192a3b63049d574e98ab04b947a3f87.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_8192a3b63049d574e98ab04b947a3f87_wo_flatten_yosys.v
