read -sv run_verilog_mult_mid/multiplier_32b_b5b4aed1c7c2f3b251c0f798e0dad20a.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_b5b4aed1c7c2f3b251c0f798e0dad20a_wo_flatten_yosys.v
