read -sv run_verilog_mult_mid/multiplier_16b_f2bda8247e5ce0545d0ae38659613077.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_f2bda8247e5ce0545d0ae38659613077_wo_flatten_yosys.v
