read -sv run_verilog_mult_mid/multiplier_16b_17725abd9aabdc30cd3dd99a5e8a4085.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_17725abd9aabdc30cd3dd99a5e8a4085_wo_flatten_yosys.v
