read -sv run_verilog_mult_mid/multiplier_32b_2fea05e64a318fc3e0c139e5e9d0fe10.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_2fea05e64a318fc3e0c139e5e9d0fe10_wo_flatten_yosys.v
