read -sv run_verilog_mult_mid/multiplier_16b_0c1701d14e68962703ce899e74a6255b.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_0c1701d14e68962703ce899e74a6255b_wo_flatten_yosys.v
