read -sv run_verilog_mult_mid/multiplier_16b_a6002e8a365d034c258e8dc6b6362cbe.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_a6002e8a365d034c258e8dc6b6362cbe_wo_flatten_yosys.v
