read -sv run_verilog_mult_mid/multiplier_16b_ec09ed19cab226be82128b04609cda0f.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_ec09ed19cab226be82128b04609cda0f_wo_flatten_yosys.v
