read -sv run_verilog_mult_mid/multiplier_32b_3c0c81f83ef5ce379cb0975149420272.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_3c0c81f83ef5ce379cb0975149420272_wo_flatten_yosys.v
