read -sv run_verilog_mult_mid/multiplier_64b_03e606866015874303be1ed80a9f89aa.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_64b_03e606866015874303be1ed80a9f89aa_wo_flatten_yosys.v
