read -sv run_verilog_mult_mid/multiplier_16b_b66b29a54463ac67dac2b72dfe3b5084.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_b66b29a54463ac67dac2b72dfe3b5084_wo_flatten_yosys.v
