read -sv run_verilog_mult_mid/multiplier_32b_0c4dbff5109bb7a4d55721445ce6d485.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_0c4dbff5109bb7a4d55721445ce6d485_wo_flatten_yosys.v
