read -sv run_verilog_mult_mid/multiplier_16b_f56df0638df7f67d64abb798b0792dbc.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_f56df0638df7f67d64abb798b0792dbc_wo_flatten_yosys.v
