read -sv run_verilog_mult_mid/multiplier_16b_605757ed0ae0c03982f8444b3a395583.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_605757ed0ae0c03982f8444b3a395583_wo_flatten_yosys.v
