read -sv run_verilog_mult_mid/multiplier_16b_9fcbf61ad64792183c4d5067e06ebbe8.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_9fcbf61ad64792183c4d5067e06ebbe8_wo_flatten_yosys.v
