read -sv run_verilog_mult_mid/multiplier_16b_8e9736d2c4c6435791ed54f053084bb9.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_8e9736d2c4c6435791ed54f053084bb9_wo_flatten_yosys.v
