read -sv run_verilog_mult_mid/multiplier_32b_692ccb1c82a57a13baaf8d824bf7b864.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_692ccb1c82a57a13baaf8d824bf7b864_wo_flatten_yosys.v
