read -sv run_verilog_mult_mid/multiplier_4b_f4871ba760976360ce54affb6bd47d5a.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_4b_f4871ba760976360ce54affb6bd47d5a_wo_flatten_yosys.v
