read -sv run_verilog_mult_mid/multiplier_16b_2c5eee9df389fded6d3f0488b33d4c25.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_2c5eee9df389fded6d3f0488b33d4c25_wo_flatten_yosys.v
