read -sv run_verilog_mult_mid/multiplier_16b_78de1f22137aa5581823bc82f988408b.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_78de1f22137aa5581823bc82f988408b_wo_flatten_yosys.v
