read -sv run_verilog_mult_mid/multiplier_16b_240aaf78eabcc9f9d11328c4d16186db.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_240aaf78eabcc9f9d11328c4d16186db_wo_flatten_yosys.v
