read -sv run_verilog_mult_mid/multiplier_16b_91fc8579a86515e9b1482a7ebf2fcd9c.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_91fc8579a86515e9b1482a7ebf2fcd9c_wo_flatten_yosys.v
