read -sv run_verilog_mult_mid/multiplier_64b_d2270bd495d00ea82ca181de721203b1.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_64b_d2270bd495d00ea82ca181de721203b1_wo_flatten_yosys.v
