read -sv run_verilog_mult_mid/multiplier_32b_0705a1eacf134333aecd58f18d3c836a.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 500
write_verilog run_yosys_mult_mid/multiplier_32b_0705a1eacf134333aecd58f18d3c836a_wo_flatten_yosys.v
