read -sv run_verilog_mult_mid/multiplier_16b_63ba046b9f8073b9724ddbca5e622ce5.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_16b_63ba046b9f8073b9724ddbca5e622ce5_wo_flatten_yosys.v
