read -sv run_verilog_mult_mid/multiplier_8b_3b6f715c3c38bbbba8da86961b92bcfc.v
synth -top main
flatten
opt
abc -fast -liberty NangateOpenCellLibrary_typical.lib -constr abc_constr -D 50
write_verilog run_yosys_mult_mid/multiplier_8b_3b6f715c3c38bbbba8da86961b92bcfc_wo_flatten_yosys.v
