read -sv run_verilog_mid/adder_32b_25_71_aa3c2c815661de31fbbe6700c6e4a1c2.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_25_71_aa3c2c815661de31fbbe6700c6e4a1c2_yosys.v
