read -sv run_verilog_mid/adder_32b_10_77_8949515181369ad88018860683d73c3d.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_77_8949515181369ad88018860683d73c3d_yosys.v
