read -sv run_verilog_mid/adder_32b_9_81_4316ccd625c46509246b4af277d8b2a3.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_9_81_4316ccd625c46509246b4af277d8b2a3_yosys.v
