read -sv run_verilog_mid/adder_32b_7_81_ad8a32f56c88d69fdcd8134b637f2ca6.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_7_81_ad8a32f56c88d69fdcd8134b637f2ca6_yosys.v
