read -sv run_verilog_mid/adder_32b_30_44_0460251c9aa064a60b45330ae5c3fdf9.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_30_44_0460251c9aa064a60b45330ae5c3fdf9_yosys.v
