read -sv run_verilog_mid/adder_32b_11_70_c0c81faa2cda28af91e7aa48970c133b.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_11_70_c0c81faa2cda28af91e7aa48970c133b_yosys.v
