read -sv run_verilog_mid/adder_32b_7_80_b4fc81f3dfe05bc4e1d0735c08e7826b.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_7_80_b4fc81f3dfe05bc4e1d0735c08e7826b_yosys.v
