read -sv run_verilog_mid/adder_32b_13_73_343598a0617aff92ffa055482eb4b418.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_13_73_343598a0617aff92ffa055482eb4b418_yosys.v
