read -sv run_verilog_mid/adder_32b_8_85_a298fc88f07889f081b04676155e9308.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_8_85_a298fc88f07889f081b04676155e9308_yosys.v
