read -sv run_verilog_mid/adder_32b_9_95_853cce34712d13dcb96cef12fc85054e.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_9_95_853cce34712d13dcb96cef12fc85054e_yosys.v
