read -sv run_verilog_mid/adder_32b_8_86_ac9c88615cf7416d26c585afe7153a5f.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_8_86_ac9c88615cf7416d26c585afe7153a5f_yosys.v
