read -sv run_verilog_mid/adder_32b_8_85_aab819228b2999a6adffa434bea90045.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_8_85_aab819228b2999a6adffa434bea90045_yosys.v
