read -sv run_verilog_mid/adder_32b_21_52_5012b1025a0bfc6e8793098ba35f9071.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_21_52_5012b1025a0bfc6e8793098ba35f9071_yosys.v
