read -sv run_verilog_mid/adder_32b_9_86_f2360238417f3632c97e375ab13dfb07.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_9_86_f2360238417f3632c97e375ab13dfb07_yosys.v
