read -sv run_verilog_mid/adder_32b_7_79_0df532daff827e9031ba88bffb2cfc63.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_7_79_0df532daff827e9031ba88bffb2cfc63_yosys.v
