read -sv run_verilog_mid/adder_32b_10_93_0863410e79bc97fbaf7796a5d5bda4dd.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_93_0863410e79bc97fbaf7796a5d5bda4dd_yosys.v
