read -sv run_verilog_mid/adder_32b_18_64_00dead42341652e57a0ac7c324f65400.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_18_64_00dead42341652e57a0ac7c324f65400_yosys.v
