read -sv run_verilog_mid/adder_32b_10_74_52ed58ceee8b35a00921865c471ad680.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_74_52ed58ceee8b35a00921865c471ad680_yosys.v
