read -sv run_verilog_mid/adder_32b_7_79_5522adf580aff3e5f2230b607d947ada.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_7_79_5522adf580aff3e5f2230b607d947ada_yosys.v
