read -sv run_verilog_mid/adder_32b_18_82_11ebbd847a2a01fba76a5bf8a1d72b61.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_18_82_11ebbd847a2a01fba76a5bf8a1d72b61_yosys.v
