read -sv run_verilog_mid/adder_32b_9_83_fcdd68f24945011e9572989bbf6d240c.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_9_83_fcdd68f24945011e9572989bbf6d240c_yosys.v
