read -sv run_verilog_mid/adder_32b_8_96_7f23f0993933c4d5cbef8003f3a2256d.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_8_96_7f23f0993933c4d5cbef8003f3a2256d_yosys.v
