read -sv run_verilog_mid/adder_32b_11_82_e932062e537db2326b195ab8d2778d44.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_11_82_e932062e537db2326b195ab8d2778d44_yosys.v
