read -sv run_verilog_mid/adder_32b_10_102_b804747c755a4cc4d30780babea89596.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_102_b804747c755a4cc4d30780babea89596_yosys.v
