read -sv run_verilog_mid/adder_32b_20_57_b79e1203fd71a3d701dd26c7b017b495.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_20_57_b79e1203fd71a3d701dd26c7b017b495_yosys.v
