read -sv run_verilog_mid/adder_32b_24_56_1224ec393f13fecdd221abb72ab3dd77.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_24_56_1224ec393f13fecdd221abb72ab3dd77_yosys.v
