read -sv run_verilog_mid/adder_32b_23_62_76315ba92e95fda8ec771ede065089a9.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_23_62_76315ba92e95fda8ec771ede065089a9_yosys.v
