read -sv run_verilog_mid/adder_32b_19_69_73241e5a5152feb348f48b572efbbae0.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_19_69_73241e5a5152feb348f48b572efbbae0_yosys.v
