read -sv run_verilog_mid/adder_32b_11_94_3723b2af9b2cd8bdd761c16c89caf0a3.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_11_94_3723b2af9b2cd8bdd761c16c89caf0a3_yosys.v
