read -sv run_verilog_mid/adder_32b_19_65_f389d18dade2676c130c18d934b1950a.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_19_65_f389d18dade2676c130c18d934b1950a_yosys.v
