read -sv run_verilog_mid/adder_32b_24_62_88971bd3abb15879ee32986c09db1fed.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_24_62_88971bd3abb15879ee32986c09db1fed_yosys.v
