read -sv run_verilog_mid/adder_32b_11_93_0cdbc806f2d3bdcd00f2d9344264f558.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_11_93_0cdbc806f2d3bdcd00f2d9344264f558_yosys.v
