read -sv run_verilog_mid/adder_32b_8_85_c590edd3c814a920e7ab5a73af02931f.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_8_85_c590edd3c814a920e7ab5a73af02931f_yosys.v
