read -sv run_verilog_mid/adder_32b_31_37_78823160aeee3611759c21bd1fe157e1.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_31_37_78823160aeee3611759c21bd1fe157e1_yosys.v
