read -sv run_verilog_mid/adder_32b_9_87_f017a3c80a90429d98ed61fc4c6d3de6.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_9_87_f017a3c80a90429d98ed61fc4c6d3de6_yosys.v
