read -sv run_verilog_mid/adder_32b_7_90_7a946576c22d3189eb8ed0aa9e6caa1e.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_7_90_7a946576c22d3189eb8ed0aa9e6caa1e_yosys.v
