read -sv run_verilog_mid/adder_32b_10_78_d86f542b34fc4d21350c403080b09e79.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_78_d86f542b34fc4d21350c403080b09e79_yosys.v
