read -sv run_verilog_mid/adder_32b_10_100_438618256842db0249c0f8e6579fab48.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_100_438618256842db0249c0f8e6579fab48_yosys.v
