read -sv run_verilog_mid/adder_32b_8_84_e9969b2af766f0d0bafcfe83aa187576.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_8_84_e9969b2af766f0d0bafcfe83aa187576_yosys.v
