read -sv run_verilog_mid/adder_32b_9_92_a32966607e488dbaf64b232dd2ac1306.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_9_92_a32966607e488dbaf64b232dd2ac1306_yosys.v
