read -sv run_verilog_mid/adder_32b_14_72_e545bef77194a44f28c541d157330df8.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_14_72_e545bef77194a44f28c541d157330df8_yosys.v
