read -sv run_verilog_mid/adder_32b_23_56_5d405cd61455b6055ec11be1221871f8.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_23_56_5d405cd61455b6055ec11be1221871f8_yosys.v
