read -sv run_verilog_mid/adder_32b_9_84_6a32c924f172b545d4291c844d1b0f0f.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_9_84_6a32c924f172b545d4291c844d1b0f0f_yosys.v
