read -sv run_verilog_mid/adder_32b_10_95_514959bb83a3570432f13615b74d89da.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_95_514959bb83a3570432f13615b74d89da_yosys.v
