read -sv run_verilog_mid/adder_32b_8_88_5f0d2fbd5d6a021522a6caf628e51398.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_8_88_5f0d2fbd5d6a021522a6caf628e51398_yosys.v
