read -sv run_verilog_mid/adder_32b_8_87_fdfac9e98bb3d69519305338233d0d3c.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_8_87_fdfac9e98bb3d69519305338233d0d3c_yosys.v
