read -sv run_verilog_mid/adder_32b_10_73_f8b8eb4c5b8ab7e36fe9243ffdc937e5.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_73_f8b8eb4c5b8ab7e36fe9243ffdc937e5_yosys.v
