read -sv run_verilog_mid/adder_32b_20_76_28ac9b9575bb830e94b475758bbd5aae.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_20_76_28ac9b9575bb830e94b475758bbd5aae_yosys.v
