read -sv run_verilog_mid/adder_32b_10_80_911a1da3e6ee078dbf7770ff8d34d13c.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_80_911a1da3e6ee078dbf7770ff8d34d13c_yosys.v
