read -sv run_verilog_mid/adder_32b_11_63_a40f86d238e0d91d506d7f9c1fb3da3e.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_11_63_a40f86d238e0d91d506d7f9c1fb3da3e_yosys.v
