read -sv run_verilog_mid/adder_32b_13_72_5cb821e3dec7e3cd77fb0dfb50940566.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_13_72_5cb821e3dec7e3cd77fb0dfb50940566_yosys.v
