read -sv run_verilog_mid/adder_32b_9_76_f1696ce2c5cc616cde0338ff3fb61424.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_9_76_f1696ce2c5cc616cde0338ff3fb61424_yosys.v
