read -sv run_verilog_mid/adder_32b_18_57_74c4567fcf913ae094a99d16777c446c.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_18_57_74c4567fcf913ae094a99d16777c446c_yosys.v
