read -sv run_verilog_mid/adder_32b_10_90_4d798ba1ed0c94f82434d3049d810cbb.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_90_4d798ba1ed0c94f82434d3049d810cbb_yosys.v
