read -sv run_verilog_mid/adder_32b_10_92_605809fbad476f8205f413e56799180c.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_92_605809fbad476f8205f413e56799180c_yosys.v
