read -sv run_verilog_mid/adder_32b_10_84_bb366c19db06963434cabba11311e5b5.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_10_84_bb366c19db06963434cabba11311e5b5_yosys.v
