read -sv run_verilog_mid/adder_32b_9_81_c6b912f43d86f26a24dce5015aa44c0c.v
hierarchy -top main
flatten
proc; techmap; opt;
abc -fast -liberty NangateOpenCellLibrary_typical.lib
write_verilog run_yosys_mid/adder_32b_9_81_c6b912f43d86f26a24dce5015aa44c0c_yosys.v
